<details>
<summary>Execution result of "run-all plan" in "infrastructure/aws"</summary>

```terraform
15:06:39.160 INFO   The stack at /github/workspace/infrastructure/aws will be processed in the following order for command plan:
Group 1
- Module management/north-virginia/aws_organization
- Module management/north-virginia/vpc


15:06:39.561 INFO   [management/north-virginia/vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git into /github/workspace/infrastructure/aws/management/north-virginia/vpc/.terragrunt-cache/tN8aN2Wrm1ax0JOoNGxYDj4UZc8/A35GeYiqYDYXDWZftKtd1kkU5ic
15:06:39.569 INFO   [management/north-virginia/aws_organization] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_organization into /github/workspace/infrastructure/aws/management/north-virginia/aws_organization/.terragrunt-cache/BmOb26uR7vqlaJoMBL_XANu2c6k/kLn2nKw80j_MBMKRZUlBCyiMAms
15:06:40.806 STDOUT [management/north-virginia/aws_organization] tofu: Initializing the backend...
15:06:40.829 STDOUT [management/north-virginia/vpc] tofu: Initializing the backend...
15:06:41.387 STDOUT [management/north-virginia/vpc] tofu: 
15:06:41.388 STDOUT [management/north-virginia/vpc] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
15:06:41.388 STDOUT [management/north-virginia/vpc] tofu: use this backend unless the backend configuration changes.
15:06:41.395 STDOUT [management/north-virginia/aws_organization] tofu: 
15:06:41.395 STDOUT [management/north-virginia/aws_organization] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
15:06:41.395 STDOUT [management/north-virginia/aws_organization] tofu: use this backend unless the backend configuration changes.
15:06:41.793 STDOUT [management/north-virginia/vpc] tofu: Initializing provider plugins...
15:06:41.793 STDOUT [management/north-virginia/vpc] tofu: - Finding hashicorp/aws versions matching ">= 5.79.0"...
15:06:41.825 STDOUT [management/north-virginia/aws_organization] tofu: Initializing provider plugins...
15:06:41.825 STDOUT [management/north-virginia/aws_organization] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
15:06:43.102 STDOUT [management/north-virginia/aws_organization] tofu: - Installing hashicorp/aws v5.92.0...
15:06:43.111 STDOUT [management/north-virginia/vpc] tofu: - Installing hashicorp/aws v5.92.0...
15:06:47.512 STDOUT [management/north-virginia/aws_organization] tofu: - Installed hashicorp/aws v5.92.0 (signed, key ID 0C0AF313E5FD9F80)
15:06:47.512 STDOUT [management/north-virginia/aws_organization] tofu: Providers are signed by their developers.
15:06:47.512 STDOUT [management/north-virginia/aws_organization] tofu: If you'd like to know more about provider signing, you can read about it here:
15:06:47.512 STDOUT [management/north-virginia/aws_organization] tofu: https://opentofu.org/docs/cli/plugins/signing/
15:06:47.512 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
15:06:47.512 STDOUT [management/north-virginia/aws_organization] tofu: selections it made above. Include this file in your version control repository
15:06:47.512 STDOUT [management/north-virginia/aws_organization] tofu: so that OpenTofu can guarantee to make the same selections by default when
15:06:47.512 STDOUT [management/north-virginia/aws_organization] tofu: you run "tofu init" in the future.
15:06:47.512 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has been successfully initialized!
15:06:47.556 STDOUT [management/north-virginia/vpc] tofu: - Installed hashicorp/aws v5.92.0 (signed, key ID 0C0AF313E5FD9F80)
15:06:47.556 STDOUT [management/north-virginia/vpc] tofu: Providers are signed by their developers.
15:06:47.556 STDOUT [management/north-virginia/vpc] tofu: If you'd like to know more about provider signing, you can read about it here:
15:06:47.556 STDOUT [management/north-virginia/vpc] tofu: https://opentofu.org/docs/cli/plugins/signing/
15:06:47.556 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
15:06:47.556 STDOUT [management/north-virginia/vpc] tofu: selections it made above. Include this file in your version control repository
15:06:47.556 STDOUT [management/north-virginia/vpc] tofu: so that OpenTofu can guarantee to make the same selections by default when
15:06:47.556 STDOUT [management/north-virginia/vpc] tofu: you run "tofu init" in the future.
15:06:47.556 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has been successfully initialized!
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu used the selected providers to generate the following execution
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu: plan. Resource actions are indicated with the following symbols:
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:   + create
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu will perform the following actions:
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:   # aws_organizations_organization.org will be created
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:   + resource "aws_organizations_organization" "org" {
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:       + accounts                      = (known after apply)
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:       + arn                           = (known after apply)
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:       + aws_service_access_principals = [
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:           + "cloudtrail.amazonaws.com",
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:           + "config.amazonaws.com",
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:         ]
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:       + feature_set                   = "ALL"
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:       + id                            = (known after apply)
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:       + master_account_arn            = (known after apply)
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:       + master_account_email          = (known after apply)
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:       + master_account_id             = (known after apply)
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:       + master_account_name           = (known after apply)
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:       + non_master_accounts           = (known after apply)
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:       + roots                         = (known after apply)
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:     }
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu: Plan: 1 to add, 0 to change, 0 to destroy.
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu: 
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu: Changes to Outputs:
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:   + organization_arn               = (known after apply)
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:   + organization_id                = (known after apply)
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:   + organization_master_account_id = (known after apply)
15:06:51.982 STDOUT [management/north-virginia/aws_organization] tofu:   + organization_roots             = (known after apply)
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu: Changes to Outputs:
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + azs                                         = [
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:       + "eu-west-1a",
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:       + "eu-west-1b",
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:       + "eu-west-1c",
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:     ]
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + cgw_arns                                    = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + cgw_ids                                     = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + database_nat_gateway_route_ids              = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + database_route_table_association_ids        = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + database_route_table_ids                    = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + database_subnet_arns                        = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + database_subnet_objects                     = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + database_subnets                            = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + database_subnets_cidr_blocks                = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + database_subnets_ipv6_cidr_blocks           = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_route_table_association_ids     = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_route_table_ids                 = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnet_arns                     = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnet_objects                  = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnets                         = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnets_cidr_blocks             = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnets_ipv6_cidr_blocks        = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + intra_route_table_association_ids           = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + intra_route_table_ids                       = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnet_arns                           = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnet_objects                        = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnets                               = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnets_cidr_blocks                   = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnets_ipv6_cidr_blocks              = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + name                                        = "my-vpc"
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + nat_ids                                     = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + nat_public_ips                              = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + natgw_ids                                   = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + natgw_interface_ids                         = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnet_arns                         = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnet_objects                      = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnets                             = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnets_cidr_blocks                 = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnets_ipv6_cidr_blocks            = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + private_ipv6_egress_route_ids               = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + private_nat_gateway_route_ids               = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + private_route_table_association_ids         = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + private_route_table_ids                     = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + private_subnet_arns                         = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + private_subnet_objects                      = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + private_subnets                             = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + private_subnets_cidr_blocks                 = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + private_subnets_ipv6_cidr_blocks            = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + public_route_table_association_ids          = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + public_route_table_ids                      = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + public_subnet_arns                          = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + public_subnet_objects                       = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + public_subnets                              = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + public_subnets_cidr_blocks                  = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + public_subnets_ipv6_cidr_blocks             = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + redshift_public_route_table_association_ids = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + redshift_route_table_association_ids        = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + redshift_route_table_ids                    = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnet_arns                        = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnet_objects                     = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnets                            = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnets_cidr_blocks                = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnets_ipv6_cidr_blocks           = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + this_customer_gateway                       = {}
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + vpc_block_public_access_exclusions          = {}
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + vpc_flow_log_cloudwatch_iam_role_arn        = ""
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + vpc_flow_log_destination_arn                = ""
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + vpc_flow_log_destination_type               = "cloud-watch-logs"
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu:   + vpc_secondary_cidr_blocks                   = []
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu: You can apply this plan to save these new output values to the OpenTofu
15:06:52.245 STDOUT [management/north-virginia/vpc] tofu: state, without changing any real infrastructure.
```

</details>
    
